const brahmiMap = {
   //aa
   '𑀓a': '𑀓𑀸', //kaa 
   '𑀔a': '𑀔𑀸', //khaa
   '𑀕a': '𑀕𑀸', //gaa
   '𑀖a': '𑀖𑀸', //ghaa
   '𑀘a': '𑀘𑀸', //caa
   '𑀙a': '𑀙𑀸', //chaa
   '𑀚a': '𑀚𑀸', //jaa
   '𑀛a': '𑀛𑀸', //jhaa
   '𑀜a': '𑀜𑀸', //ñaa
   '𑀝a': '𑀝𑀸', //ṭaa
   '𑀞a': '𑀞𑀸', //ṭhaa
   '𑀟a': '𑀟𑀸', //ḍaa
   '𑀠a': '𑀠𑀸', //ḍhaa
   '𑀗a': '𑀗𑀸', //ngaa (ṅaa)
   '𑀢a': '𑀢𑀸', //taa
   '𑀣a': '𑀣𑀸', //thaa
   '𑀤a': '𑀤𑀸', //daa
   '𑀥a': '𑀤𑀸', //dhaa
   '𑀦a': '𑀦𑀸', //na
   '𑀧a': '𑀧𑀸', //paa
   '𑀨a': '𑀨𑀸', //phaa 
   '𑀩a': '𑀩𑀸', //baa
   '𑀪a': '𑀪𑀸', //bhaa 
   '𑀰a': '𑀰𑀸', //śaa
   '𑀱a': '𑀱𑀸', //ṣaa
   '𑀲a': '𑀲𑀸', //saa
   '𑀴a': '𑀴𑀸', //ḷaa
   '𑀡a': '𑀡𑀸', //ṇaa
   '𑀫a': '𑀫𑀸', //maa
   '𑀬a': '𑀬𑀸', //yaa
   '𑀭a': '𑀭𑀸', //raa
   '𑀮a': '𑀮𑀸', //laa
   '𑀯a': '𑀯𑀸', //vaa
   '𑀳a': '𑀳𑀸', //haa

   //ii
 '𑀓𑀺i': '𑀓𑀺', //kii
 '𑀔𑀺i': '𑀔𑀺', //khii
 '𑀕𑀺i': '𑀕𑀺', //gii
 
 '𑀖𑁆i': '𑀖𑀺', //ghii
 '𑀘𑁆i': '𑀘𑀺', //cii
 '𑀙𑁆i': '𑀙𑀺', //chii
 '𑀚𑁆i': '𑀚𑀺', //jii
 '𑀛𑁆i': '𑀛𑀺', //jhii
 '𑀜𑁆i': '𑀜𑀺', //ñii
 '𑀝𑁆i': '𑀝𑀺', //ṭii
 '𑀞𑁆i': '𑀞𑀺', //ṭhii
 '𑀟𑁆i': '𑀟𑀺', //ḍii
 '𑀠𑁆i': '𑀠𑀺', //ḍhii
 '𑀗𑁆i': '𑀡𑀺', //ngii (ṅii)
 '𑀢𑁆i': '𑀢𑀺', //tii
 '𑀣𑁆i': '𑀣𑀺', //thii
 '𑀤𑁆i': '𑀤𑀺', //dii
 '𑀥𑁆i': '𑀥𑀺', //dhii
 '𑀦𑁆i': '𑀦𑀺', //nii
 '𑀧𑁆i': '𑀧𑀺', //pii
 '𑀨𑁆i': '𑀨𑀺', //phii 
 '𑀩𑁆i': '𑀩𑀺', //bii
 '𑀪𑁆i': '𑀪𑀺', //bhii 
 '𑀰𑁆i': '𑀰𑀺', //śii
 '𑀱𑁆i': '𑀱𑀺', //ṣii
 '𑀲𑁆i': '𑀲𑀺', //sii
 '𑀴𑁆i': '𑀴𑀺', //ḷii
 '𑀡𑁆i': '𑀡𑀺', //ṇii
 '𑀫𑁆i': '𑀫𑀺', //mii
 '𑀬𑁆i': '𑀬𑀺', //yii
 '𑀭𑁆i': '𑀭𑀺', //rii
 '𑀮𑁆i': '𑀮𑀺', //lii
 '𑀯𑁆i': '𑀯𑀺', //vii
 '𑀳𑁆i': '𑀳𑀺', //hii
 
  //a
  '𑀓𑁆a': '𑀓', //ka 
  '𑀔𑁆a': '𑀔', //kha
  '𑀕𑁆a': '𑀕', //ga
  '𑀖𑁆a': '𑀖', //gha
  '𑀘𑁆a': '𑀘', //ca
  '𑀙𑁆a': '𑀙', //cha
  '𑀚𑁆a': '𑀚', //ja
  '𑀛𑁆a': '𑀛', //jha
  '𑀜𑁆a': '𑀜', //ña
  '𑀝𑁆a': '𑀝', //ṭa
  '𑀞𑁆a': '𑀞', //ṭha
  '𑀟𑁆a': '𑀟', //ḍa
  '𑀠𑁆a': '𑀠', //ḍha
  '𑀗𑁆a': '𑀗', //nga (ṅa)
  '𑀢𑁆a': '𑀢', //ta
  '𑀣𑁆a': '𑀣', //tha
  '𑀤𑁆a': '𑀤', //da 
  '𑀥𑁆': '𑀥', //dha 
  '𑀦𑁆a': '𑀦', //n
  '𑀧𑁆a': '𑀧', //pa 
  '𑀨𑁆a': '𑀨', //pha 
  '𑀩𑁆a': '𑀩', //ba 
  '𑀪𑁆a': '𑀪', //bha 
  '𑀰𑁆a': '𑀰', //śa 
  '𑀱𑁆a': '𑀱', //ṣa 
  '𑀲𑁆a': '𑀲', //sa 
  '𑀴𑁆a': '𑀴', //ḷa 
  '𑀡𑁆a': '𑀡', //ṇa
  '𑀫𑁆a': '𑀫', //ma
  '𑀬𑁆a': '𑀬', //ya
  '𑀭𑁆a': '𑀭', //ra 
  '𑀮𑁆a': '𑀮', //la
  '𑀯𑁆a': '𑀯', //va
  '𑀳𑁆a': '𑀳', //ha

 //i
 '𑀓𑁆i': '𑀓𑀺', //ki
 '𑀔𑁆i': '𑀔𑀺', //khi
 '𑀕𑁆i': '𑀕𑀺', //gi
 '𑀖𑁆i': '𑀖𑀺', //ghi
 '𑀘𑁆i': '𑀘𑀺', //ci
 '𑀙𑁆i': '𑀙𑀺', //chi
 '𑀚𑁆i': '𑀚𑀺', //ji
 '𑀛𑁆i': '𑀛𑀺', //jhi
 '𑀜𑁆i': '𑀜𑀺', //ñi
 '𑀝𑁆i': '𑀝𑀺', //ṭi
 '𑀞𑁆i': '𑀞𑀺', //ṭhi
 '𑀟𑁆i': '𑀟𑀺', //ḍi
 '𑀠𑁆i': '𑀠𑀺', //ḍhi
 '𑀗𑁆i': '𑀡𑀺', //ngi (ṅi)
 '𑀢𑁆i': '𑀢𑀺', //ti
 '𑀣𑁆i': '𑀣𑀺', //thi
 '𑀤𑁆i': '𑀤𑀺', //di
 '𑀥𑁆i': '𑀥𑀺', //dhi
 '𑀦𑁆i': '𑀦𑀺', //ni
 '𑀧𑁆i': '𑀧𑀺', //pi
 '𑀨𑁆i': '𑀨𑀺', //phi 
 '𑀩𑁆i': '𑀩𑀺', //bi
 '𑀪𑁆i': '𑀪𑀺', //bhi 
 '𑀰𑁆i': '𑀰𑀺', //śi
 '𑀱𑁆i': '𑀱𑀺', //ṣi
 '𑀲𑁆i': '𑀲𑀺', //si
 '𑀴𑁆i': '𑀴𑀺', //ḷi
 '𑀡𑁆i': '𑀡𑀺', //ṇi
 '𑀫𑁆i': '𑀫𑀺', //mi
 '𑀬𑁆i': '𑀬𑀺', //yi
 '𑀭𑁆i': '𑀭𑀺', //ri
 '𑀮𑁆i': '𑀮𑀺', //li
 '𑀯𑁆i': '𑀯𑀺', //vi
 '𑀳𑁆i': '𑀳𑀺', //hi



  //basic vowels
  '𑀅a': '𑀆', //long a
  '𑀇i': '𑀈', // long i
  '𑀉u': '𑀊', //long u
  '𑀋=': '𑀌', // long voc. r
  '𑀍=': '𑀎', //long voc. l
  '𑀅i': '𑀐', //ai
  '𑀅u': '𑀒', //au
  'a': '𑀅', //a
  'i': '𑀇', //i
  'u': '𑀉', //u
  '𑀭𑁆=': '𑀋', //voc. r
  '𑀮𑁆=': '𑀍', //voc. l
  'e': '𑀏', //e
  'o': '𑀑', //o

  //basic consonant
  '𑀓𑁆h': '𑀔𑁆', //kh
  '𑀕𑁆h': '𑀖𑁆', //gh
  '𑀘𑁆h': '𑀙𑁆', //ch
  '𑀚𑁆h': '𑀛𑁆', //jh
  '𑀦𑁆y': '𑀜𑁆', //ñ
  '𑀝𑁆h': '𑀞𑁆', //ṭh
  '𑀟𑁆h': '𑀠𑁆', //ḍh
  '𑀦𑁆g': '𑀗𑁆', //ng (ṅ)
  '𑀢𑁆h': '𑀣𑁆', //th
  '𑀤𑁆h': '𑀥𑁆', //dh
  '𑀧𑁆h': '𑀨𑁆', //ph
  '𑀩𑁆h': '𑀪𑁆', //bh
  '𑀲𑁆h': '𑀰𑁆', //ś
  '𑀲𑁆=': '𑀱𑁆', //ṣ
  '𑀢𑁆=': '𑀝𑁆', //ṭ
  '𑀤𑁆=': '𑀟𑁆', //ḍ
  '𑀦𑁆=': '𑀡𑁆', //ṇ
  '𑀮𑁆.': '𑀴𑁆', //ḷ
  'k': '𑀓𑁆', //k
  'g': '𑀕𑁆', //g
  'c': '𑀘𑁆', //c
  'j': '𑀚𑁆', //j
  't': '𑀢𑁆', //t
  'd': '𑀤𑁆', //d
  'n': '𑀦𑁆', //n
  'p': '𑀧𑁆', //p
  'b': '𑀩𑁆', //b
  'm': '𑀫𑁆', //m
  'y': '𑀬𑁆', //y
  'r': '𑀭𑁆', //r   
  'l': '𑀮𑁆', //l
  'v': '𑀯𑁆', //v
  's': '𑀲𑁆', //s
  'h': '𑀳𑁆', //h
};

const textArea = document.getElementById('textArea');

const delay = 100;

let timeoutId;

function transcribe(event) {
  clearTimeout(timeoutId);
  timeoutId = setTimeout(() => {
  const currentText = event.target.value;

  let processedText = currentText;
  for(const [key, value] of Object.entries(brahmiMap)) {
    const regex = new RegExp(key, 'g');
    processedText= processedText.replace(regex, value);
  }
  processedText = processedText.replace(/σ\s/g, 'ς ');
  event.target.value = processedText;
}, delay);
}

textArea.addEventListener('input', transcribe);

function copyFn() {
  const textArea = document.getElementById('textArea');
  
  textArea.select();
  textArea.setSelectionRange(0, 99999); //mobile odd tings

  try {
    navigator.clipboard.writeText(textArea.value).then(()=> {
      alert('Text copied to clipboard!');
    }).catch (err => {
      alert('Failed to copy text. Please try again!');
      console.error('Error copying text: ', err);
    });
  } catch (err) {
    alert('Failed to copy text. Please try again!');
    console.error('Error copying text: ', err);
  }
}